artillery.yml
config:
  # target: 'http://ec2-54-237-99-128.compute-1.amazonaws.com'
  target: 'http://localhost:3001'
  phases:
  - duration: 10
    arrivalRate: 3
    name: 'stand-up'
  - duration: 20
    arrivalRate: 10
    name: 'high-traffic'
  - duration: 10
    arrivalRate: 6
    name: 'normal-traffic'
  - duration: 20
    arrivalRate: 20
    name: 'spike'
  - duration: 10
    arrivalRate: 3
    name: 'stand-down'
  processor: './artillery_functions.js'
scenarios:
  - flow:
    - get:
        url: '/'
    - get:
        url: '/bundle.js'
    - loop:
      - function: 'getRandFirst'
      - get:
          url: '/products/{{ id }}'
      - function: 'getRandSecond'
      - get:
          url: '/products/{{ id }}'
      - function: 'getRandTenPercent'
      - get:
          url: '/products/{{ id }}'
      count: 68